package com.example.data.dto

import com.example.data.util.safeApiCall
import retrofit2.Response
import retrofit2.http.GET
import retrofit2.http.POST
import retrofit2.http.Query

/**
 * Retrofit API для получения архивов, в которых собрана
 * информация по различным документам и операциям.
 *
 * Все методы возвращают [Response], чтобы [safeApiCall]
 * мог получить доступ к коду ответа и телу ошибки для детального маппинга исключений.
 */
interface ArchiveApi {

    /**
     * Получение архива событий.
     *
     * @param startdate дата начала просматриваемого периода в формате dd.MM.yyyy HH:mm:ss
     * @param enddate дата окончания просматриваемого периода в формате dd.MM.yyyy HH:mm:ss
     * @param page номер запрашиваемой страницы с данными (для случая, когда количество
     *             возвращаемых строк за выбранный период больше указанного в запросе или
     *             заданного по умолчанию)
     * @param records количество записей на одной странице.
     * @return [Response<ArchiveDto<EventDto>>] с архивом событий.
     *
     * Коды ответов сервера:
     * - 200 — успешное выполнение команды (в теле запроса JSON)
     * - 204 — за заданный промежуток времени события отсутствуют в системе (тело запроса является пустым)
     * - 400 — некорректно сформирован запрос  или невозможно проверить права пользователя
     * - 401 — необходимо выполнить вход в систему
     * - 403 — пользователь не имеет необходимых прав на просмотр информации из архива
     * - 419 — истек срок действия Access Token. Необходимо восстановить его с помощью Refresh Token
     * - 500 — внутренняя ошибка получения информации о точках разгрузки
     */
    @GET("api/events")
    suspend fun getEvents(
        @Query("startdate") startDate: String,
        @Query("enddate")   endDate: String,
        @Query("page")      page: Int,
        @Query("records")   records: Int
    ): Response<ArchiveDto<EventDto>>

    /**
     * Получение архива ручных отгрузок.
     *
     * @param startdate дата начала просматриваемого периода в формате dd.mm.yyyyy hh:nn:ss
     * @param enddate дата окончания просматриваемого периода в формате dd.mm.yyyyy hh:nn:ss
     * @param page номер запрашиваемой страницы с данными (для случая, когда количество
     *             возвращаемых строк за выбранный период больше указанного в запросе или
     *             заданного по умолчанию)
     * @param records количество записей на одной странице.
     * @return [Response<ArchiveDto<EventDto>>] с архивом событий.
     *
     * Коды ответов сервера:
     * - 200 — успешное выполнение команды (в теле запроса JSON)
     * - 204 — за заданный промежуток времени события отсутствуют в системе (тело запроса является пустым)
     * - 400 — некорректно сформирован запрос  или невозможно проверить права пользователя
     * - 401 — необходимо выполнить вход в систему
     * - 403 — пользователь не имеет необходимых прав на просмотр информации из архива
     * - 419 — истек срок действия Access Token. Необходимо восстановить его с помощью Refresh Token
     * - 500 — внутренняя ошибка получения информации о точках разгрузки
     */
    @GET("api/handloads")
    suspend fun getHandLoads(
        @Query("startdate") startDate: String,
        @Query("enddate")   endDate: String,
        @Query("page")      page: Int,
        @Query("records")   records: Int
    ): Response<ArchiveDto<HandLoadDto>>
}