package com.example.data.remote

import com.example.data.dto.DstPointDto
import com.example.data.util.safeApiCall
import retrofit2.Response
import retrofit2.http.GET
import retrofit2.http.Path

/**
 * Retrofit API для получения информации о точках выгрузки бетона.
 *
 * Все методы возвращают [Response], чтобы [safeApiCall]
 * мог получить доступ к коду ответа и телу ошибки для детального маппинга исключений.
 */
interface DstPointsApi {

    /**
     * Получение информацию о точке выгрузки бетона.
     *
     * @param zoneid  код точки выгрузки бетона.
     * @return [DstPoint] с данными точки выгрузки бетона.
     *
     * Коды ответов сервера:
     * - 200 — успешное выполнение команды (в теле запроса JSON)
     * - 204 — точки выгрузки отсутствуют в системе (тело запроса является пустым)
     * - 400 — некорректно сформирован запрос
     * - 401 — необходимо выполнить вход в систему
     * - 404 — точка выгрузки бетона не найдена в базе данных
     * - 419 — истек срок действия Access Token. Необходимо восстановить его с помощью Refresh Token
     * - 5xx — внутренняя ошибка получения информации о точках разгрузки
     */
    @GET("/apb/dst-points/{zoneid}")
    suspend fun getDstPoint(@Path("zoneid") id: Int): Response<DstPointDto>

    /**
     * Получение полного списка точек выгрузки бетона.
     *
     * @return список [DstPoint] с данными точек выгрузки бетона.
     *
     * Коды ответов сервера:
     * - 200 — успешное выполнение команды (в теле запроса JSON)
     * - 204 — точки выгрузки отсутствуют в системе (тело запроса является пустым)
     * - 400 — некорректно сформирован запрос
     * - 401 — необходимо выполнить вход в систему
     * - 404 — точка выгрузки бетона не найдена в базе данных
     * - 419 — истек срок действия Access Token. Необходимо восстановить его с помощью Refresh Token
     * - 5xx — внутренняя ошибка получения информации о точках разгрузки
     */
    @GET("/apb/dst-points")
    suspend fun getDstPointsList(): Response<List<DstPointDto>>
}