package com.example.data.remote

import com.example.data.dto.LoginRequestDto
import com.example.data.dto.LoginResponseDto
import com.example.data.util.safeApiCall
import retrofit2.Response
import retrofit2.http.Body
import retrofit2.http.GET
import retrofit2.http.POST
import retrofit2.http.Path

/**
 * Retrofit API для операций c очередью транспортных средств на отгрузочных терминалах.
 *
 * Все методы возвращают [Response], чтобы [safeApiCall]
 * мог получить доступ к коду ответа и телу ошибки для детального маппинга исключений.
 */
interface QueueApi {
    /**
     * Мониторинг текущего состояния очереди на отгрузку.
     *
     * @return [Response<List<Queue>>] с данными продукта, разрешенного для отгрузки в заданную точку выгрузки.
     *
     * Коды ответов сервера:
     * - 200 — успешное выполнение команды (в теле запроса JSON)
     * - 204 — очередь на отгрузку отсутствует (тело запроса является пустым)
     * - 400 — некорректно сформирован запрос или невозможно проверить права пользователя
     * - 401 — необходимо выполнить вход в систему
     * - 403 — пользователь не имеет необходимых прав на просмотр информации об очереди на отгрузку
     * - 419 — истек срок действия Access Token. Необходимо восстановить его с помощью Refresh Token
     * - 5xx — внутренняя ошибка получения информации о продуктах, разрешенных для заданной зоны
     */
    @GET("api/queue")
    suspend fun getQueue(): Response<Unit>

    /**
     * Мониторинг текущего состояния очереди на отгрузку по коду отгрузочного терминала.
     *
     * @param terminalId Код отгрузочного терминала.
     * @return [Response<List<Queue>>] с данными продукта, разрешенного для отгрузки в заданную точку выгрузки.
     *
     * Коды ответов сервера:
     * - 200 — успешное выполнение команды (в теле запроса JSON)
     * - 204 — очередь на отгрузку отсутствует (тело запроса является пустым)
     * - 400 — некорректно сформирован запрос или невозможно проверить права пользователя
     * - 401 — необходимо выполнить вход в систему
     * - 403 — пользователь не имеет необходимых прав на просмотр информации об очереди на отгрузку
     * - 419 — истек срок действия Access Token. Необходимо восстановить его с помощью Refresh Token
     * - 5xx — внутренняя ошибка получения информации о продуктах, разрешенных для заданной зоны
     */
    @GET("/api/queue/{termid}")
    suspend fun getQueueByTerminalId(@Path("termid") terminalId: String): Response<Unit>

    /**
     * Мониторинг текущего состояния очереди на отгрузку по номеру отгрузочного терминала.
     *
     * @param terminalNum Номер отгрузочного терминала.
     * @return [Response<List<Queue>>] с данными продукта, разрешенного для отгрузки в заданную точку выгрузки.
     *
     * Коды ответов сервера:
     * - 200 — успешное выполнение команды (в теле запроса JSON)
     * - 204 — очередь на отгрузку отсутствует (тело запроса является пустым)
     * - 400 — некорректно сформирован запрос или невозможно проверить права пользователя
     * - 401 — необходимо выполнить вход в систему
     * - 403 — пользователь не имеет необходимых прав на просмотр информации об очереди на отгрузку
     * - 419 — истек срок действия Access Token. Необходимо восстановить его с помощью Refresh Token
     * - 5xx — внутренняя ошибка получения информации о продуктах, разрешенных для заданной зоны
     */
    @GET("/api/queue/byno/{termno}")
    suspend fun getQueueByTerminalNum(@Path("termno") terminalNum: Int): Response<Unit>

}